modm-ext/data.modm.io/docs/svd/header_stm32h725xx.svd
        <register>
          <name>FDRH6</name>
          <description>RAMECC monitor failing data high register</description>
          <addressOffset>0xd0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FECR6</name>
          <description>RAMECC monitor failing ECC error code register</description>
          <addressOffset>0xd4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FEC</name>
              <description>Failing error code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="OCTOSPI1">
      <name>OCTOSPI2</name>
      <description>OCTO Serial Peripheral Interface</description>
      <groupName>OCTOSPI</groupName>
      <baseAddress>0x5200a000</baseAddress>
      <interrupt>
        <name>OCTOSPI2</name>
        <description>OctoSPI2 global interrupt</description>
        <value>150</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="DLYB_SDMMC2">
      <name>DLYB_OCTOSPI2</name>
      <description>Delay Block DLYB</description>
      <groupName>DLYB</groupName>
      <baseAddress>0x5200b000</baseAddress>
    </peripheral>
    <peripheral>
      <name>OCTOSPIM</name>
      <description>OCTO Serial Peripheral Interface IO Manager</description>
      <groupName>OCTOSPIM</groupName>
      <baseAddress>0x5200b400</baseAddress>
      <registers>
        <register>
          <name>CR</name>
          <description>OCTOSPI IO Manager Control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MUXEN</name>
              <description>Multiplexed mode enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REQ2ACK_TIME</name>
              <description>REQ to ACK time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCR0</name>
          <description>OCTOSPI IO Manager Port[1:3] Configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKEN</name>
              <description>CLK/CLKn Enable for Port n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>CLK/CLKn Source for Port n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSEN</name>
              <description>DQS Enable for Port n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSSRC</name>
              <description>DQS Source for Port n</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NCSEN</name>
              <description>nCS Enable for Port n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NCSSRC</name>
              <description>nCS Source for Port n</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOLEN</name>
              <description>IO[3:0] Enable for Port n</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOLSRC</name>
              <description>IO[3:0] Source for Port n</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IOHEN</name>
              <description>IO[7:4] Enable for Port n</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOHSRC</name>
              <description>IO[7:4] Source for Port n</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCR1</name>
          <description>OCTOSPI IO Manager Port[1:3] Configuration register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKEN</name>
              <description>CLK/CLKn Enable for Port n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>CLK/CLKn Source for Port n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSEN</name>
              <description>DQS Enable for Port n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSSRC</name>
              <description>DQS Source for Port n</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NCSEN</name>
              <description>nCS Enable for Port n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NCSSRC</name>
              <description>nCS Source for Port n</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOLEN</name>
              <description>IO[3:0] Enable for Port n</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOLSRC</name>
              <description>IO[3:0] Source for Port n</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IOHEN</name>
              <description>IO[7:4] Enable for Port n</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOHSRC</name>
              <description>IO[7:4] Source for Port n</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCR2</name>
          <description>OCTOSPI IO Manager Port[1:3] Configuration register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKEN</name>
              <description>CLK/CLKn Enable for Port n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>CLK/CLKn Source for Port n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSEN</name>
              <description>DQS Enable for Port n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSSRC</name>
              <description>DQS Source for Port n</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NCSEN</name>
              <description>nCS Enable for Port n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NCSSRC</name>
              <description>nCS Source for Port n</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOLEN</name>
              <description>IO[3:0] Enable for Port n</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOLSRC</name>
              <description>IO[3:0] Source for Port n</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IOHEN</name>
              <description>IO[7:4] Enable for Port n</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOHSRC</name>
              <description>IO[7:4] Source for Port n</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
