modm-ext/data.modm.io/docs/svd/header_stm32h725xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>Power Control</description>
      <groupName>PWR</groupName>
      <baseAddress>0x58024800</baseAddress>
      <registers>
        <register>
          <name>CR1</name>
          <description>PWR power control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LPDS</name>
              <description>Low Power Deepsleep with SVOS3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAIN</name>
                  <description>Voltage Regulator in main mode during deepsleep mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW_POWER</name>
                  <description>Voltage Regulator in low-power mode during deepsleep mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PVDEN</name>
              <description>Programmable Voltage detector enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLS</name>
              <description>Programmable Voltage Detector level selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PVDLEVEL_0</name>
                  <description>Voltage threshold detected by PVD 1.95 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_1</name>
                  <description>Voltage threshold detected by PVD 2.1 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_2</name>
                  <description>Voltage threshold detected by PVD 2.25 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_3</name>
                  <description>Voltage threshold detected by PVD 2.4 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_4</name>
                  <description>Voltage threshold detected by PVD 2.55 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_5</name>
                  <description>Voltage threshold detected by PVD 2.7 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_6</name>
                  <description>Voltage threshold detected by PVD 2.85 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_7</name>
                  <description>External voltage level on PVD_IN pin, compared to internal VREFINT level.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBP</name>
              <description>Disable Back-up domain Protection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLPS</name>
              <description>Flash low power mode in DSTOP</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SVOS</name>
              <description>System STOP mode Voltage Scaling selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCALE3</name>
                  <description>Select voltage scale 3 when system enters STOP mode</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE4</name>
                  <description>Select voltage scale 4 when system enters STOP mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE5</name>
                  <description>Select voltage scale 5 when system enters STOP mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVDEN</name>
              <description>Analog Voltage Detector Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALS</name>
              <description>Analog Voltage Detector level selection</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVDLEVEL_0</name>
                  <description>Analog Voltage threshold detected by AVD 1.7 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVDLEVEL_1</name>
                  <description>Analog Voltage threshold detected by AVD 2.1 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVDLEVEL_2</name>
                  <description>Analog Voltage threshold detected by AVD 2.5 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVDLEVEL_3</name>
                  <description>Analog Voltage threshold detected by AVD 2.8 V</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR1</name>
          <description>PWR power control status register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PVDO</name>
              <description>Programmable Voltage Detect Output</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTVOSRDY</name>
              <description>Ready bit for current actual used VOS for VDD11 Voltage Scaling</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTVOS</name>
              <description>Current actual used VOS for VDD11 Voltage Scaling</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AVDO</name>
              <description>Analog Voltage Detect Output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>PWR power control register 2</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BREN</name>
              <description>Backup regulator enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MONEN</name>
              <description>VBAT and temperature monitoring enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRRDY</name>
              <description>Backup regulator ready</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBATL</name>
              <description>Monitored VBAT level above low threshold</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBATH</name>
              <description>Monitored VBAT level above high threshold</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEMPL</name>
              <description>Monitored temperature level above low threshold</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEMPH</name>
              <description>Monitored temperature level above high threshold</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <description>PWR power control register 3</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BYPASS</name>
              <description>Power Management Unit bypass</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDOEN</name>
              <description>Low Drop Output regulator enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPSEN</name>
              <description>SMPS Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPSEXTHP</name>
              <description>SMPS forced ON and in High Power MR mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPSLEVEL</name>
              <description>SMPS output Voltage</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VBE</name>
              <description>VBAT charging enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBRS</name>
              <description>VBAT charging resistor selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHARG_RESISTOR_5K</name>
                  <description>Charge the Battery through a 5 kO resistor</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHARGRESISTOR_1_5K</name>
                  <description>Charge the Battery through a 1.5 kO resistor</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMPSEXTRDY</name>
              <description>SMPS External supply ready</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USB33DEN</name>
              <description>VDD33_USB voltage level detector enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBREGEN</name>
              <description>USB regulator enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USB33RDY</name>
              <description>USB supply ready</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUCR</name>
          <description>PWR CPU control register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PDDS_D1</name>
              <description>D1 domain Power Down Deepsleep selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D1STOP</name>
                  <description>Enter D1 domain to Stop mode when the CPU enters deepsleep</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D1STANDBY</name>
                  <description>Enter D1 domain to Standby mode when the CPU enters deepsleep</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDDS_D2</name>
              <description>D2 domain Power Down Deepsleep</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D2STOP</name>
                  <description>Enter D2 domain to Stop mode when the CPU enters deepsleep</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D2STANDBY</name>
                  <description>Enter D2 domain to Standby mode when the CPU enters deepsleep</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDDS_D3</name>
              <description>System D3 domain Power Down Deepsleep</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D3STOP</name>
                  <description>Enter D3 domain to Stop mode when the CPU enters deepsleep</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D3STANDBY</name>
                  <description>Enter D3 domain to Standby mode when the CPU enters deepsleep</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPF</name>
              <description>STOP Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SBF</name>
              <description>System STANDBY Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SBF_D1</name>
              <description>D1 domain DSTANDBY Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SBF_D2</name>
              <description>D2 domain DSTANDBY Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSSF</name>
              <description>Clear D1 domain CPU1 STANDBY, STOP and HOLD flags</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUN_D3</name>
              <description>Keep system D3 domain in RUN mode regardless of the CPU sub-systems modes</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>D3CR</name>
          <description>PWR D3 domain control register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VOSRDY</name>
              <description>VOS Ready bit for VDD11 Voltage Scaling output selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VOS</name>
              <description>Voltage Scaling selection according performance</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUPCR</name>
          <description>PWR wakeup clear register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WKUPC1</name>
              <description>Clear Wakeup Pin Flag 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPC2</name>
              <description>Clear Wakeup Pin Flag 2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPC4</name>
              <description>Clear Wakeup Pin Flag 4</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPC6</name>
              <description>Clear Wakeup Pin Flag 6</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUPFR</name>
          <description>PWR wakeup flag register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WKUPF1</name>
              <description>Wakeup Pin Flag 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPF2</name>
              <description>Wakeup Pin Flag 2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPF4</name>
              <description>Wakeup Pin Flag 4</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPF6</name>
              <description>Wakeup Pin Flag 6</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUPEPR</name>
          <description>PWR wakeup enable and polarity register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WKUPEN1</name>
              <description>Enable Wakeup Pin WKUP1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPEN2</name>
              <description>Enable Wakeup Pin WKUP2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPEN4</name>
              <description>Enable Wakeup Pin WKUP4</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPEN6</name>
              <description>Enable Wakeup Pin WKUP6</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPP1</name>
              <description>Wakeup Pin Polarity for WKUP1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPP2</name>
              <description>Wakeup Pin Polarity for WKUP2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPP4</name>
              <description>Wakeup Pin Polarity for WKUP4</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPP6</name>
              <description>Wakeup Pin Polarity for WKUP6</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPPUPD1</name>
              <description>Wakeup Pin pull configuration for WKUP1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WKUPPUPD2</name>
              <description>Wakeup Pin pull configuration for WKUP2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WKUPPUPD4</name>
              <description>Wakeup Pin pull configuration for WKUP4</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WKUPPUPD6</name>
              <description>Wakeup Pin pull configuration for WKUP6</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
