modm-ext/data.modm.io/docs/svd/header_stm32h725xx.svd
        <register>
          <name>C1MISR</name>
          <description>HSEM Interrupt Masked Status register</description>
          <addressOffset>0x10c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MISF0</name>
              <description>semaphore 0 interrupt 0 masked status bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF1</name>
              <description>semaphore 1 interrupt 0 masked status bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF2</name>
              <description>semaphore 2 interrupt 0 masked status bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF3</name>
              <description>semaphore 3 interrupt 0 masked status bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF4</name>
              <description>semaphore 4 interrupt 0 masked status bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF5</name>
              <description>semaphore 5 interrupt 0 masked status bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF6</name>
              <description>semaphore 6 interrupt 0 masked status bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF7</name>
              <description>semaphore 7 interrupt 0 masked status bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF8</name>
              <description>semaphore 8 interrupt 0 masked status bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF9</name>
              <description>semaphore 9 interrupt 0 masked status bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF10</name>
              <description>semaphore 10 interrupt 0 masked status bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF11</name>
              <description>semaphore 11 interrupt 0 masked status bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF12</name>
              <description>semaphore 12 interrupt 0 masked status bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF13</name>
              <description>semaphore 13 interrupt 0 masked status bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF14</name>
              <description>semaphore 14 interrupt 0 masked status bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF15</name>
              <description>semaphore 15 interrupt 0 masked status bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF16</name>
              <description>semaphore 16 interrupt 0 masked status bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF17</name>
              <description>semaphore 17 interrupt 0 masked status bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF18</name>
              <description>semaphore 18 interrupt 0 masked status bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF19</name>
              <description>semaphore 19 interrupt 0 masked status bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF20</name>
              <description>semaphore 20 interrupt 0 masked status bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF21</name>
              <description>semaphore 21 interrupt 0 masked status bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF22</name>
              <description>semaphore 22 interrupt 0 masked status bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF23</name>
              <description>semaphore 23 interrupt 0 masked status bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF24</name>
              <description>semaphore 24 interrupt 0 masked status bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF25</name>
              <description>semaphore 25 interrupt 0 masked status bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF26</name>
              <description>semaphore 26 interrupt 0 masked status bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF27</name>
              <description>semaphore 27 interrupt 0 masked status bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF28</name>
              <description>semaphore 28 interrupt 0 masked status bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF29</name>
              <description>semaphore 29 interrupt 0 masked status bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF30</name>
              <description>semaphore 30 interrupt 0 masked status bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF31</name>
              <description>semaphore 31 interrupt 0 masked status bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>HSEM Semaphore clear register</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>COREID</name>
              <description>CoreID of semaphores to be cleared</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>KEY</name>
              <description>semaphores clear key</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYR</name>
          <description>HSEM Semaphore clear key register</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>semaphores clear key</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
